* >Natural Source Header 000000
* :Mode S
* :CP IBM01140
* :LineIncrement 10
* <Natural Source Header
define data local
1 vehi view of vehicles
  2 personnel-id
  2 colour
local
1 #ct(n08)
1 #i(n06)
1 #n(n06)
1 #loop(n06)
1 #error(n04)
1 redefine #error
  2 #lev (n01)
  2 #sublev(n03)
end-define
*
on error
  move *error-nr to #error
  terminate #sublev
end-error
*
move 5  to #loop
perform updating
define subroutine updating
for #i 1 #loop
  r1. read vehi by personnel-id
    compress *timx into colour
    add 1 to #ct
    add 1 to #n
  end-read
end-for
end-subroutine
end
