* >Natural Source Header 000000
* :Mode S
* :CP IBM01140
* <Natural Source Header
* MAP2: PROTOTYPE VERSION 820 --- CREATED BY NAT 0902030002 ---
* INPUT USING MAP 'XXXXXXXX'
*     #CV-EMP05-PERSONNEL-ID #MSG-BAR #PFKEY-BAR EMP05.ADDRESS-LINE(*)
*     EMP05.AREA-CODE EMP05.BIRTH EMP05.BONUS(*,*) EMP05.CITY
*     EMP05.COUNTRY EMP05.CURR-CODE(*) EMP05.DEPT EMP05.FIRST-NAME
*     EMP05.JOB-TITLE EMP05.LANG(*) EMP05.LEAVE-DUE EMP05.LEAVE-END(*)
*     EMP05.LEAVE-START(*) EMP05.LEAVE-TAKEN EMP05.MAR-STAT
*     EMP05.MIDDLE-NAME EMP05.NAME EMP05.PERSONNEL-ID EMP05.PHONE
*     EMP05.SALARY(*) EMP05.SEX EMP05.ZIP
DEFINE DATA PARAMETER
1  #CV-EMP05-PERSONNEL-ID (C)
1 #MSG-BAR (A050)
1 #PFKEY-BAR (A053)
1 EMP05.ADDRESS-LINE (A020/00001:00003)
1 EMP05.AREA-CODE (A006)
1 EMP05.BIRTH (D)
1 EMP05.BONUS (P09.0/00001:00002,00001:00002)
1 EMP05.CITY (A020)
1 EMP05.COUNTRY (A003)
1 EMP05.CURR-CODE (A003/00001:00002)
1 EMP05.DEPT (A006)
1 EMP05.FIRST-NAME (A020)
1 EMP05.JOB-TITLE (A025)
1 EMP05.LANG (A003/00001:00003)
1 EMP05.LEAVE-DUE (N02.0)
1 EMP05.LEAVE-END (N08.0/00001:00002)
1 EMP05.LEAVE-START (N08.0/00001:00002)
1 EMP05.LEAVE-TAKEN (N02.0)
1 EMP05.MAR-STAT (A001)
1 EMP05.MIDDLE-NAME (A020)
1 EMP05.NAME (A020)
1 EMP05.PERSONNEL-ID (A008)
1 EMP05.PHONE (A015)
1 EMP05.SALARY (P09.0/00001:00002)
1 EMP05.SEX (A001)
1 EMP05.ZIP (A010)
END-DEFINE
FORMAT PS=024 LS=079 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        410***********
* .TTAAAMMOO   D I D I N D I D I        ?_)?&:+(                       *
* 024079        N1NNUCN             X        01 SYSPROF NR             *
************************************************************************
INPUT          (     IP=OFF                                           /*
                                                                       )
/
 003T *USER  (AD=DLOFHT' ' CD=TU ) /*.01S008 A008 .
 018T 'Adabas Auditing/Replication Demo Application'(GRV)
 070T *PROGRAM  (AD=DLOFHT' ' CD=TU ) /*.01S008 A008 .
/
 070T *DATE  (AD=DLOFHT' ' CD=TU ) /*.01S008 A008 .
/
 003T 'Personnel ID'
/
 003T EMP05.PERSONNEL-ID  (AD=YLMEHT'_' CD=GR /*.99V008 A008 .
      CV=#CV-EMP05-PERSONNEL-ID )
 018T #MSG-BAR  (AD=BLOFHW CD=PI ) /*.01U050 A050 .
/
/
 003T 'First Name'
 024T 'Name'
 045T 'Middle Name'
 067T 'Languages'
/
 003T EMP05.FIRST-NAME  (AD=DLMFHT'_' ) /*.99V020 A020 .
 024T EMP05.NAME  (AD=DLMFHT'_' ) /*.99V020 A020 .
 045T EMP05.MIDDLE-NAME  (AD=DLMFHT'_' ) /*.99V020 A020 .
 067T EMP05.LANG (001)  (AD=DLMFHT'_' ) /*.99V003 A003 .
   /**A1000030000100001000010000100001100001003001000001000HV
 071T EMP05.LANG (002)  (AD=DLMFHT'_' ) /*.99V003 A003 .
 075T EMP05.LANG (003)  (AD=DLMFHT'_' ) /*.99V003 A003 .
/
/
 003T 'Mar.Stat'
 013T 'Sex'
 020T 'Address'
 041T 'City'
 063T 'ZIP'
/
 003T EMP05.MAR-STAT  (AD=DLMFHT'_' ) /*.99V001 A001 .
 013T EMP05.SEX  (AD=DLMFHT'_' ) /*.99V001 A001 .
 020T EMP05.ADDRESS-LINE (001)  (AD=DLMFHT'_' ) /*.99V020 A020 .
   /**A1000030000100001000010000100001100003001001000001000HV
 041T EMP05.CITY  (AD=DLMFHT'_' ) /*.99V020 A020 .
 063T EMP05.ZIP  (AD=DLMFHT'_' ) /*.99V010 A010 .
/
 003T 'Birth'
 020T EMP05.ADDRESS-LINE (002)  (AD=DLMFHT'_' ) /*.99V020 A020 .
 041T 'Country'
 049T 'Area'
 058T 'Phone'
/
 003T EMP05.BIRTH  (AD=DLMFHT' ' ) /*.99V008 D    .
 020T EMP05.ADDRESS-LINE (003)  (AD=DLMFHT'_' ) /*.99V020 A020 .
 041T EMP05.COUNTRY  (AD=DLMFHT'_' ) /*.99V003 A003 .
 049T EMP05.AREA-CODE  (AD=DLMFHT'_' ) /*.99V006 A006 .
 058T EMP05.PHONE  (AD=DLMFHT'_' ) /*.99V015 A015 .
/
/
 003T 'Dept.'
 012T 'Job Title'
 044T 'Salary'
 056T 'Bonus'
 063T 'Currency'
/
 003T EMP05.DEPT  (AD=DLMFHT'_' ) /*.99V006 A006 .
 012T EMP05.JOB-TITLE  (AD=DLMFHT'_' ) /*.99V025 A025 .
 041T EMP05.SALARY (001)  (AD=DLMFHT' ' EM=Z,ZZZ,999 ) /*.99V009 P09.0.
   /**A1000020000100001000010000100001100002001001000001000HV
 052T EMP05.BONUS (001,001)  (AD=DLMFHT' ' /*.99V009 P09.0.
      EM=Z,ZZZ,999 )
   /**A2000020000200001000010000100001120002002001000001000HV
 063T EMP05.CURR-CODE (001)  (AD=DLMFHT'_' ) /*.99U003 A003 .
   /**A1000020000100001000010000100001100002001001001001000HV
/
 052T EMP05.BONUS (001,002)  (AD=DLMFHT' ' /*.99V009 P09.0.
      EM=Z,ZZZ,999 )
/
 003T 'Leave Start'
 016T 'Leave End'
 027T 'Due'
 032T 'Taken'
 041T EMP05.SALARY (002)  (AD=DLMFHT' ' EM=Z,ZZZ,999 ) /*.99V009 P09.0.
 052T EMP05.BONUS (002,001)  (AD=DLMFHT' ' /*.99V009 P09.0.
      EM=Z,ZZZ,999 )
 063T EMP05.CURR-CODE (002)  (AD=DLMFHT'_' ) /*.99U003 A003 .
/
 006T EMP05.LEAVE-START (001)  (AD=DRMFHT'_' ) /*.99U008 N08.0.
   /**A1000020000100001000010000100001100002001001000001000HV
 017T EMP05.LEAVE-END (001)  (AD=DRMFHT'_' ) /*.99U008 N08.0.
   /**A1000020000100001000010000100001100002001001000001000HV
 028T EMP05.LEAVE-DUE  (AD=VLMFHT'_' CD=YE ) /*.99V002 N02.0.
 035T EMP05.LEAVE-TAKEN  (AD=VLMFHT'_' CD=RE ) /*.99V002 N02.0.
 052T EMP05.BONUS (002,002)  (AD=DLMFHT' ' /*.99V009 P09.0.
      EM=Z,ZZZ,999 )
/
 006T EMP05.LEAVE-START (002)  (AD=DRMFHT'_' ) /*.99U008 N08.0.
 017T EMP05.LEAVE-END (002)  (AD=DRMFHT'_' ) /*.99U008 N08.0.
/
/
 013T #PFKEY-BAR  (AD=ILOFHW CD=PI ) /*.01U053 A053 .
/
/
* MAP2: VALIDATION *****************************************************
RULEVAR D01EMP05.PERSONNEL-ID
INCDIR DEMO-EMPL-05                     PERSONNEL-ID                    ;
RULEVAR D01#MSG-BAR
* CDIR DEMO-EMPL-05                     FIRST-NAME                      ;
RULEVAR D01EMP05.FIRST-NAME
INCDIR DEMO-EMPL-05                     FIRST-NAME                      ;
RULEVAR D01EMP05.NAME
INCDIR DEMO-EMPL-05                     NAME                            ;
RULEVAR D01EMP05.MIDDLE-NAME
INCDIR DEMO-EMPL-05                     MIDDLE-NAME                     ;
RULEVAR D01EMP05.LANG
INCDIR DEMO-EMPL-05                     LANG                            ;
RULEVAR D01EMP05.MAR-STAT
INCDIR DEMO-EMPL-05                     MAR-STAT                        ;
RULEVAR D01EMP05.SEX
INCDIR DEMO-EMPL-05                     SEX                             ;
RULEVAR D01EMP05.ADDRESS-LINE
INCDIR DEMO-EMPL-05                     ADDRESS-LINE                    ;
RULEVAR D01EMP05.CITY
INCDIR DEMO-EMPL-05                     CITY                            ;
RULEVAR D01EMP05.ZIP
INCDIR DEMO-EMPL-05                     ZIP                             ;
RULEVAR D01EMP05.BIRTH
INCDIR EMPLOYEES                        BIRTH                           ;
RULEVAR D01EMP05.COUNTRY
INCDIR DEMO-EMPL-05                     COUNTRY                         ;
RULEVAR D01EMP05.AREA-CODE
INCDIR DEMO-EMPL-05                     AREA-CODE                       ;
RULEVAR D01EMP05.PHONE
INCDIR DEMO-EMPL-05                     PHONE                           ;
RULEVAR D01EMP05.DEPT
INCDIR DEMO-EMPL-05                     DEPT                            ;
RULEVAR D01EMP05.JOB-TITLE
INCDIR DEMO-EMPL-05                     JOB-TITLE                       ;
RULEVAR D01EMP05.SALARY
INCDIR EMPLOYEES                        SALARY                          ;
RULEVAR D01EMP05.BONUS
INCDIR EMPLOYEES                        BONUS                           ;
RULEVAR D01EMP05.CURR-CODE
INCDIR DEMO-EMPL-05                     CURR-CODE                       ;
RULEVAR D01EMP05.LEAVE-START
INCDIR DEMO-EMPL-05                     LEAVE-START                     ;
RULEVAR D01EMP05.LEAVE-END
INCDIR DEMO-EMPL-05                     LEAVE-END                       ;
RULEVAR D01EMP05.LEAVE-DUE
INCDIR DEMO-EMPL-05                     LEAVE-DUE                       ;
RULEVAR D01EMP05.LEAVE-TAKEN
INCDIR DEMO-EMPL-05                     LEAVE-TAKEN                     ;
RULEVAR D01#PFKEY-BAR
* CDIR DEMO-EMPL-05                     FIRST-NAME                      ;
* MAP2: END OF MAP *****************************************************
END
