* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 V VIEW OF EMPLOYEES
  2 PERSONNEL-ID
  2 NAME
  2 FIRST-NAME
  2 JOB-TITLE
  2 CITY
  2 COUNTRY
1 CT (N05)
END-DEFINE
READ V
  WRITE WORK FILE 1 PERSONNEL-ID NAME FIRST-NAME JOB-TITLE CITY COUNTRY
  ADD 1 TO CT
END-READ
CLOSE WORK FILE 1
WRITE 'NUMBER OF RECORDS WRITTEN TO WORK FILE 1 AT' *DATE   *TIME CT
END
