DEFINE DATA LOCAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP IBM01140
/* <Natural Source Header
1 EMP05 VIEW OF EMPLOYEES
  2 PERSONNEL-ID (A8)
  2 FULL-NAME
    3 FIRST-NAME (A20)
    3 NAME (A20)
  2 MIDDLE-NAME (A20)
  2 MAR-STAT (A1)
  2 SEX (A1)
  2 BIRTH (D)
  2 N@BIRTH (I2)
  2 FULL-ADDRESS
    3 ADDRESS-LINE (A20/1:3)
    3 CITY (A20)
    3 ZIP (A10)
    3 COUNTRY (A3)
  2 TELEPHONE
    3 AREA-CODE (A6)
    3 PHONE (A15)
  2 DEPT (A6)
  2 JOB-TITLE (A25)
  2 INCOME (1:2)
    3 CURR-CODE (A3)
    3 SALARY (P9)
    3 BONUS (P9/1:2)
  2 LEAVE-DATA
    3 LEAVE-DUE (N2)
    3 LEAVE-TAKEN (N2)
  2 LEAVE-BOOKED (1:2)
    3 LEAVE-START (N8)
    3 LEAVE-END (N8)
  2 LANG (A3/1:3)
END-DEFINE
