DEFINE DATA GLOBAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
/** New Global Data Area GLO.
/**
/** :author brtdo
/* TODO Enter your data definitions here
1 +NOME (A10)
1 +IDADE (N02)
END-DEFINE
